Revit 2027 API
BuiltInFailures.AutoRouteFailures.NoAutoRouteSolutionFoundWarning Property
 No auto-route solution was found.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoAutoRouteSolutionFoundWarning { get; }
Public Shared ReadOnly Property NoAutoRouteSolutionFoundWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoAutoRouteSolutionFoundWarning {
	FailureDefinitionId^ get ();
}
static member NoAutoRouteSolutionFoundWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace